results/test1/zvol/b/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [F(4)][100.0%][w=128KiB/s][w=32 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1096: Sat Mar 16 17:27:39 2024
  write: IOPS=318, BW=1274KiB/s (1305kB/s)(77.4MiB/62194msec); 0 zone resets
    slat (nsec): min=542, max=29610k, avg=51568.52, stdev=424964.90
    clat (nsec): min=591, max=4765.3M, avg=24468231.15, stdev=258333617.78
     lat (usec): min=19, max=4765.3k, avg=24519.80, stdev=258332.54
    clat percentiles (nsec):
     |  1.00th=[      1608],  5.00th=[     21120], 10.00th=[     58624],
     | 20.00th=[    110080], 30.00th=[    183296], 40.00th=[    259072],
     | 50.00th=[    358400], 60.00th=[    501760], 70.00th=[    757760],
     | 80.00th=[   1171456], 90.00th=[   1990656], 95.00th=[   3489792],
     | 99.00th=[ 859832320], 99.50th=[1837105152], 99.90th=[4596957184],
     | 99.95th=[4731174912], 99.99th=[4731174912]
   bw (  KiB/s): min=  320, max=11880, per=94.62%, avg=4657.56, stdev=3379.63, samples=34
   iops        : min=   80, max= 2970, avg=1164.35, stdev=844.96, samples=34
  lat (nsec)   : 750=0.07%, 1000=0.20%
  lat (usec)   : 2=1.31%, 4=1.43%, 10=1.17%, 20=0.73%, 50=2.94%
  lat (usec)   : 100=10.60%, 250=20.40%, 500=21.02%, 750=9.99%, 1000=6.88%
  lat (msec)   : 2=13.30%, 4=5.56%, 10=2.15%, 20=0.66%, 50=0.43%
  lat (msec)   : 100=0.01%, 500=0.12%, 750=0.04%, 1000=0.12%, 2000=0.48%
  lat (msec)   : >=2000=0.40%
  cpu          : usr=0.37%, sys=5.29%, ctx=39211, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.1%, 4=51.1%, 8=43.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.4%, 8=3.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19809,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1097: Sat Mar 16 17:27:39 2024
  write: IOPS=304, BW=1219KiB/s (1248kB/s)(73.8MiB/61987msec); 0 zone resets
    slat (nsec): min=281, max=40471k, avg=53780.03, stdev=529928.36
    clat (nsec): min=541, max=4763.0M, avg=25688657.51, stdev=264497426.86
     lat (usec): min=20, max=4763.1k, avg=25742.44, stdev=264494.68
    clat percentiles (nsec):
     |  1.00th=[       940],  5.00th=[      5856], 10.00th=[     50944],
     | 20.00th=[     95744], 30.00th=[    171008], 40.00th=[    244736],
     | 50.00th=[    342016], 60.00th=[    493568], 70.00th=[    733184],
     | 80.00th=[   1171456], 90.00th=[   2007040], 95.00th=[   3588096],
     | 99.00th=[ 884998144], 99.50th=[1920991232], 99.90th=[4596957184],
     | 99.95th=[4731174912], 99.99th=[4731174912]
   bw (  KiB/s): min=  264, max=11265, per=90.19%, avg=4439.91, stdev=3127.20, samples=34
   iops        : min=   66, max= 2816, avg=1109.94, stdev=781.78, samples=34
  lat (nsec)   : 750=0.50%, 1000=0.64%
  lat (usec)   : 2=1.62%, 4=1.41%, 10=2.05%, 20=1.42%, 50=2.19%
  lat (usec)   : 100=10.73%, 250=20.19%, 500=19.70%, 750=10.01%, 1000=6.19%
  lat (msec)   : 2=13.28%, 4=5.48%, 10=2.11%, 20=0.71%, 50=0.55%
  lat (msec)   : 100=0.01%, 500=0.13%, 750=0.04%, 1000=0.13%, 2000=0.51%
  lat (msec)   : >=2000=0.42%
  cpu          : usr=0.35%, sys=4.91%, ctx=37276, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.4%, 4=51.6%, 8=43.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,18884,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1098: Sat Mar 16 17:27:39 2024
  write: IOPS=286, BW=1144KiB/s (1172kB/s)(69.5MiB/62194msec); 0 zone resets
    slat (nsec): min=301, max=40835k, avg=67849.60, stdev=506863.79
    clat (nsec): min=591, max=4768.4M, avg=27211178.99, stdev=272341644.87
     lat (usec): min=19, max=4768.4k, avg=27279.03, stdev=272338.74
    clat percentiles (nsec):
     |  1.00th=[       804],  5.00th=[      4128], 10.00th=[     47360],
     | 20.00th=[     99840], 30.00th=[    181248], 40.00th=[    257024],
     | 50.00th=[    362496], 60.00th=[    514048], 70.00th=[    782336],
     | 80.00th=[   1220608], 90.00th=[   2072576], 95.00th=[   3784704],
     | 99.00th=[ 918552576], 99.50th=[1937768448], 99.90th=[4596957184],
     | 99.95th=[4731174912], 99.99th=[4798283776]
   bw (  KiB/s): min=  392, max=11233, per=87.55%, avg=4309.12, stdev=2932.55, samples=33
   iops        : min=   98, max= 2808, avg=1077.24, stdev=733.12, samples=33
  lat (nsec)   : 750=0.79%, 1000=0.84%
  lat (usec)   : 2=1.69%, 4=1.61%, 10=1.65%, 20=1.20%, 50=2.80%
  lat (usec)   : 100=9.42%, 250=19.01%, 500=20.28%, 750=9.74%, 1000=6.90%
  lat (msec)   : 2=13.42%, 4=5.86%, 10=2.27%, 20=0.65%, 50=0.53%
  lat (msec)   : 100=0.02%, 500=0.13%, 750=0.05%, 1000=0.13%, 2000=0.54%
  lat (msec)   : >=2000=0.45%
  cpu          : usr=0.33%, sys=4.57%, ctx=35384, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.4%, 4=51.4%, 8=42.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.0%, 8=4.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,17789,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 17:27:39 2024
  write: IOPS=322, BW=1289KiB/s (1320kB/s)(78.3MiB/62193msec); 0 zone resets
    slat (nsec): min=251, max=27022k, avg=49878.44, stdev=362885.14
    clat (nsec): min=561, max=4769.0M, avg=24211720.43, stdev=256614072.75
     lat (usec): min=18, max=4769.0k, avg=24261.60, stdev=256612.76
    clat percentiles (nsec):
     |  1.00th=[      1012],  5.00th=[      3472], 10.00th=[     50944],
     | 20.00th=[     91648], 30.00th=[    160768], 40.00th=[    238592],
     | 50.00th=[    346112], 60.00th=[    497664], 70.00th=[    749568],
     | 80.00th=[   1155072], 90.00th=[   2056192], 95.00th=[   3686400],
     | 99.00th=[ 583008256], 99.50th=[1837105152], 99.90th=[4596957184],
     | 99.95th=[4731174912], 99.99th=[4731174912]
   bw (  KiB/s): min=  296, max=14864, per=95.75%, avg=4713.38, stdev=3602.44, samples=34
   iops        : min=   74, max= 3716, avg=1178.32, stdev=900.59, samples=34
  lat (nsec)   : 750=0.35%, 1000=0.61%
  lat (usec)   : 2=2.21%, 4=2.14%, 10=1.34%, 20=0.58%, 50=2.59%
  lat (usec)   : 100=11.68%, 250=19.82%, 500=18.70%, 750=9.99%, 1000=6.75%
  lat (msec)   : 2=12.78%, 4=5.73%, 10=2.25%, 20=0.77%, 50=0.53%
  lat (msec)   : 100=0.01%, 500=0.12%, 750=0.04%, 1000=0.12%, 2000=0.48%
  lat (msec)   : >=2000=0.40%
  cpu          : usr=0.38%, sys=5.32%, ctx=38994, majf=0, minf=0
  IO depths    : 1=0.7%, 2=4.9%, 4=50.8%, 8=43.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.4%, 8=3.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20047,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=4922KiB/s (5040kB/s), 1144KiB/s-1289KiB/s (1172kB/s-1320kB/s), io=299MiB (313MB), run=61987-62194msec