results/test1/zvol/b/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][0.3%][eta 06h:57m:56s]
random-write: (groupid=0, jobs=1): err= 0: pid=1103: Sat Mar 16 17:45:35 2024
  write: IOPS=366, BW=183KiB/s (187kB/s)(11.7MiB/65188msec); 0 zone resets
    slat (nsec): min=391, max=14651k, avg=31567.19, stdev=183000.90
    clat (nsec): min=592, max=17265M, avg=21698969.97, stdev=377078676.74
     lat (usec): min=20, max=17265k, avg=21730.54, stdev=377078.79
    clat percentiles (nsec):
     |  1.00th=[       1528],  5.00th=[      29824], 10.00th=[      64768],
     | 20.00th=[     105984], 30.00th=[     168960], 40.00th=[     228352],
     | 50.00th=[     305152], 60.00th=[     407552], 70.00th=[     569344],
     | 80.00th=[     897024], 90.00th=[    1761280], 95.00th=[    3358720],
     | 99.00th=[   19005440], 99.50th=[ 1484783616], 99.90th=[ 4932501504],
     | 99.95th=[ 5200936960], 99.99th=[17112760320]
   bw (  KiB/s): min=    1, max= 2147, per=100.00%, avg=822.62, stdev=581.78, samples=29
   iops        : min=    2, max= 4294, avg=1645.24, stdev=1163.57, samples=29
  lat (nsec)   : 750=0.13%, 1000=0.30%
  lat (usec)   : 2=1.01%, 4=0.96%, 10=1.20%, 20=0.89%, 50=1.73%
  lat (usec)   : 100=12.66%, 250=24.30%, 500=23.45%, 750=9.87%, 1000=5.61%
  lat (msec)   : 2=9.26%, 4=4.63%, 10=2.76%, 20=0.30%, 50=0.17%
  lat (msec)   : 750=0.03%, 1000=0.13%, 2000=0.23%, >=2000=0.37%
  cpu          : usr=0.42%, sys=3.91%, ctx=46604, majf=0, minf=0
  IO depths    : 1=0.5%, 2=3.8%, 4=49.1%, 8=46.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.8%, 8=3.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,23860,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1104: Sat Mar 16 17:45:35 2024
  write: IOPS=332, BW=166KiB/s (170kB/s)(10.6MiB/65188msec); 0 zone resets
    slat (nsec): min=240, max=10549k, avg=38849.44, stdev=228139.04
    clat (nsec): min=611, max=17266M, avg=23842026.60, stdev=395369711.06
     lat (usec): min=19, max=17266k, avg=23880.88, stdev=395368.98
    clat percentiles (nsec):
     |  1.00th=[       1832],  5.00th=[      29568], 10.00th=[      68096],
     | 20.00th=[     120320], 30.00th=[     191488], 40.00th=[     252928],
     | 50.00th=[     337920], 60.00th=[     448512], 70.00th=[     626688],
     | 80.00th=[     978944], 90.00th=[    1957888], 95.00th=[    3653632],
     | 99.00th=[   20316160], 99.50th=[ 1518338048], 99.90th=[ 4932501504],
     | 99.95th=[ 5200936960], 99.99th=[17112760320]
   bw (  KiB/s): min=    1, max= 1838, per=100.00%, avg=747.86, stdev=524.04, samples=29
   iops        : min=    2, max= 3676, avg=1495.72, stdev=1048.08, samples=29
  lat (nsec)   : 750=0.22%, 1000=0.13%
  lat (usec)   : 2=0.80%, 4=1.13%, 10=1.18%, 20=0.94%, 50=1.99%
  lat (usec)   : 100=9.99%, 250=23.32%, 500=23.98%, 750=10.57%, 1000=6.12%
  lat (msec)   : 2=9.94%, 4=5.22%, 10=3.01%, 20=0.42%, 50=0.19%
  lat (msec)   : 750=0.04%, 1000=0.15%, 2000=0.26%, >=2000=0.41%
  cpu          : usr=0.39%, sys=3.49%, ctx=42597, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.1%, 4=49.3%, 8=45.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.3%, 8=3.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,21696,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1105: Sat Mar 16 17:45:35 2024
  write: IOPS=352, BW=176KiB/s (181kB/s)(11.2MiB/65188msec); 0 zone resets
    slat (nsec): min=481, max=18141k, avg=33906.04, stdev=200330.06
    clat (nsec): min=591, max=17264M, avg=22522105.83, stdev=384190638.41
     lat (usec): min=21, max=17264k, avg=22556.01, stdev=384190.43
    clat percentiles (nsec):
     |  1.00th=[       1192],  5.00th=[      21376], 10.00th=[      63232],
     | 20.00th=[     112128], 30.00th=[     183296], 40.00th=[     242688],
     | 50.00th=[     325632], 60.00th=[     440320], 70.00th=[     610304],
     | 80.00th=[     946176], 90.00th=[    1826816], 95.00th=[    3457024],
     | 99.00th=[   19005440], 99.50th=[ 1484783616], 99.90th=[ 4932501504],
     | 99.95th=[ 5200936960], 99.99th=[17112760320]
   bw (  KiB/s): min=    2, max= 1816, per=100.00%, avg=792.31, stdev=538.85, samples=29
   iops        : min=    4, max= 3632, avg=1584.62, stdev=1077.69, samples=29
  lat (nsec)   : 750=0.31%, 1000=0.46%
  lat (usec)   : 2=1.05%, 4=1.00%, 10=1.23%, 20=0.86%, 50=1.98%
  lat (usec)   : 100=11.17%, 250=23.00%, 500=22.91%, 750=11.20%, 1000=5.88%
  lat (msec)   : 2=10.09%, 4=4.76%, 10=2.76%, 20=0.40%, 50=0.15%
  lat (msec)   : 750=0.03%, 1000=0.14%, 2000=0.24%, >=2000=0.38%
  cpu          : usr=0.40%, sys=3.70%, ctx=46021, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.3%, 4=47.9%, 8=47.4%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.7%, 8=3.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22983,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1106: Sat Mar 16 17:45:35 2024
  write: IOPS=347, BW=174KiB/s (178kB/s)(11.1MiB/65187msec); 0 zone resets
    slat (nsec): min=471, max=44518k, avg=36561.41, stdev=411971.83
    clat (nsec): min=611, max=17265M, avg=22832430.16, stdev=386911427.39
     lat (usec): min=20, max=17265k, avg=22868.99, stdev=386911.04
    clat percentiles (nsec):
     |  1.00th=[       1004],  5.00th=[      18816], 10.00th=[      63232],
     | 20.00th=[     114176], 30.00th=[     187392], 40.00th=[     246784],
     | 50.00th=[     329728], 60.00th=[     436224], 70.00th=[     610304],
     | 80.00th=[     946176], 90.00th=[    1843200], 95.00th=[    3391488],
     | 99.00th=[   20578304], 99.50th=[ 1484783616], 99.90th=[ 4932501504],
     | 99.95th=[ 5200936960], 99.99th=[17112760320]
   bw (  KiB/s): min=    3, max= 1736, per=100.00%, avg=781.24, stdev=540.46, samples=29
   iops        : min=    6, max= 3472, avg=1562.52, stdev=1080.93, samples=29
  lat (nsec)   : 750=0.39%, 1000=0.60%
  lat (usec)   : 2=1.02%, 4=1.04%, 10=1.18%, 20=0.83%, 50=2.01%
  lat (usec)   : 100=10.67%, 250=22.76%, 500=23.75%, 750=10.89%, 1000=6.05%
  lat (msec)   : 2=9.75%, 4=5.03%, 10=2.82%, 20=0.16%, 50=0.20%
  lat (msec)   : 100=0.01%, 750=0.04%, 1000=0.14%, 2000=0.25%, >=2000=0.39%
  cpu          : usr=0.40%, sys=3.65%, ctx=43351, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.1%, 4=49.9%, 8=45.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.5%, 8=3.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22663,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=700KiB/s (716kB/s), 166KiB/s-183KiB/s (170kB/s-187kB/s), io=44.5MiB (46.7MB), run=65187-65188msec